In [1]:
# importing sqlit3
import sqlite3

In [2]:
# object creation and new data base creation

db1=sqlite3.connect("new_studentdatabase.db")

In [3]:
# setting up cursor to work(working in temporary memory area) 

cur=db1.cursor()

In [4]:
# creating table name
cur.execute("create table student(name text,id int primary key,marks int)")

In [5]:
print(cur.rowcount)

-1

In [9]:
cur.execute("insert into student values('Ajit',1,50)")

In [10]:
db1.commit()

In [12]:
cur.execute("insert into student values('Amit',2,56),('Aniket',3,67),('barun',4,90),('rajib',6,98),('rohit',5,78),('ratan',7,89)")
db1.commit()

IntegrityError: UNIQUE constraint failed: student.id

In [13]:
print(cur.rowcount)

-1

In [14]:
result=cur.execute("Select * from student")

for i in result:
    print(i)

('Ajit', 1, 50)
('Amit', 2, 56)
('Aniket', 3, 67)
('barun', 4, 90)
('rajib', 6, 98)
('rohit', 5, 78)
('ratan', 7, 89)

In [15]:
db1.commit()

In [18]:
cur.execute("insert into student values('chintu',8,70),('chunmun',9,90),('ravi',10,67),('ratul',11,87),('ramesh',12,45)")
db1.commit()

In [19]:
result=cur.execute("select * from student")

for i in result:
    print(i,end=" ")

('Ajit', 1, 50) ('Amit', 2, 56) ('Aniket', 3, 67) ('barun', 4, 90) ('rajib', 6, 98) ('rohit', 5, 78) ('ratan', 7, 89) ('chintu', 8, 70) ('chunmun', 9, 90) ('ravi', 10, 67) ('ratul', 11, 87) ('ramesh', 12, 45)

In [1]:
import sqlite3

In [2]:
db1=sqlite3.connect("new_studentdatabase.db")

In [3]:
cur=db1.cursor()

In [5]:
result=cur.execute("select * from student")

for i in result:
    print(i)

('Ajit', 1, 50)
('Amit', 2, 56)
('Aniket', 3, 67)
('barun', 4, 90)
('rajib', 6, 98)
('rohit', 5, 78)
('ratan', 7, 89)
('chintu', 8, 70)
('chunmun', 9, 90)
('ravi', 10, 67)
('ratul', 11, 87)
('ramesh', 12, 45)

In [7]:
cur.execute("insert into student values('jack',13,40),('jill',14,60),('jishan',15,80)")
db1.commit()

In [8]:
result=cur.execute("select * from student")

for i in result:
    print(i)

('Ajit', 1, 50)
('Amit', 2, 56)
('Aniket', 3, 67)
('barun', 4, 90)
('rajib', 6, 98)
('rohit', 5, 78)
('ratan', 7, 89)
('chintu', 8, 70)
('chunmun', 9, 90)
('ravi', 10, 67)
('ratul', 11, 87)
('ramesh', 12, 45)
('jack', 13, 40)
('jill', 14, 60)
('jishan', 15, 80)

In [10]:
results=cur.execute("select marks from student where id=2")

for i in result:
    print (i)

(56,)

In [11]:
results=cur.execute("select name,marks from student where id=2")

for i in result:
    print(i)

('Amit', 56)

In [12]:
result=cur.execute("select * from student where marks>=80")

for i in result:
    print(i)

('barun', 4, 90)
('rajib', 6, 98)
('ratan', 7, 89)
('chunmun', 9, 90)
('ratul', 11, 87)
('jishan', 15, 80)

In [14]:
result=cur.execute("select * from student where marks<=80")

for i in result:
    print(i)

('Ajit', 1, 50)
('Amit', 2, 56)
('Aniket', 3, 67)
('rohit', 5, 78)
('chintu', 8, 70)
('ravi', 10, 67)
('ramesh', 12, 45)
('jack', 13, 40)
('jill', 14, 60)
('jishan', 15, 80)

In [19]:
result=cur.execute("select name from student where marks=45")

for i in result:
    print(i)

('ramesh',)

In [20]:
result=cur.execute("select marks from student where name='jill'")

for i in result:
    print(i)

(60,)

In [29]:
#if a is true and b is true, result will be true
#true and false is false

Fetch all Methord:

In [23]:
result=cur.execute("select * from student")

for i in result:
    print (i,end=" ")

('Ajit', 1, 50) ('Amit', 2, 56) ('Aniket', 3, 67) ('barun', 4, 90) ('rajib', 6, 98) ('rohit', 5, 78) ('ratan', 7, 89) ('chintu', 8, 70) ('chunmun', 9, 90) ('ravi', 10, 67) ('ratul', 11, 87) ('ramesh', 12, 45) ('jack', 13, 40) ('jill', 14, 60) ('jishan', 15, 80)

In [24]:
result=cur.execute("select * from student")
# fetchall function
result.fetchall()

[('Ajit', 1, 50),
 ('Amit', 2, 56),
 ('Aniket', 3, 67),
 ('barun', 4, 90),
 ('rajib', 6, 98),
 ('rohit', 5, 78),
 ('ratan', 7, 89),
 ('chintu', 8, 70),
 ('chunmun', 9, 90),
 ('ravi', 10, 67),
 ('ratul', 11, 87),
 ('ramesh', 12, 45),
 ('jack', 13, 40),
 ('jill', 14, 60),
 ('jishan', 15, 80)]

order by clause

In [25]:
# order by accending

results=cur.execute("select * from student order by name asc")

for i in results:
    print(i)

('Ajit', 1, 50)
('Amit', 2, 56)
('Aniket', 3, 67)
('barun', 4, 90)
('chintu', 8, 70)
('chunmun', 9, 90)
('jack', 13, 40)
('jill', 14, 60)
('jishan', 15, 80)
('rajib', 6, 98)
('ramesh', 12, 45)
('ratan', 7, 89)
('ratul', 11, 87)
('ravi', 10, 67)
('rohit', 5, 78)

In [30]:
# order by decending

result=cur.execute("select * from student order by name desc")

for i in result:
    print(i,end=" ")

('rohit', 5, 78) ('ravi', 10, 67) ('ratul', 11, 87) ('ratan', 7, 89) ('ramesh', 12, 45) ('rajib', 6, 98) ('jishan', 15, 80) ('jill', 14, 60) ('jack', 13, 40) ('chunmun', 9, 90) ('chintu', 8, 70) ('barun', 4, 90) ('Aniket', 3, 67) ('Amit', 2, 56) ('Ajit', 1, 50)

# AND Operator

In [32]:
#result displayed as true (true and true)

results=cur.execute("Select * from student where name='chintu' and marks=70")

for i in result:
    print(i)

('chintu', 8, 70)

In [34]:
# no results true and false is false

results=cur.execute("Select * from student where name='chintu'  and marks=80")

for i in result:
    print(i)

In [35]:
# true and true is true

results= cur.execute("select * from student where id=4 and marks=90")

In [36]:
for i in result:
    print(i)

('barun', 4, 90)

In [37]:
# true and false is false so 

result=cur.execute("select * from student where id=4 and marks= 80")

for i in result:
    print(i)

# Or operator:

In [38]:
result=cur.execute("select * from student where id=4 or marks=80")

for i in result:
    print(i)

('barun', 4, 90)
('jishan', 15, 80)

In [40]:
result=cur.execute("select * from student where id=1 or marks=90")

for i in result:
    print(i)

('Ajit', 1, 50)
('barun', 4, 90)
('chunmun', 9, 90)

In [41]:
result=cur.execute("select * from student where id=1 or marks=90")

result.fetchall()

[('Ajit', 1, 50), ('barun', 4, 90), ('chunmun', 9, 90)]

# AGGREGATE FUNCTION

In [42]:
# FIND MAXIMUM MARKS by fetch one function

results=cur.execute("select max(marks) from student")
results.fetchone()

(98,)

In [46]:
# find minimum marks by fetch one function

results=cur.execute("select min(marks) from student")
results.fetchone()

(40,)

In [48]:
# find avg marks by fetch one function

results=cur.execute("select avg(marks) from student")
results.fetchone()

(71.13333333333334,)

In [49]:
# find sum

results=cur.execute("select sum(marks) from student")

results.fetchone()

(1067,)

In [50]:
# count id's

result=cur.execute("Select count(id) from student")
results.fetchone()

(15,)

In [51]:
result=cur.execute("select * from student")
results.fetchall()

[('Ajit', 1, 50),
 ('Amit', 2, 56),
 ('Aniket', 3, 67),
 ('barun', 4, 90),
 ('rajib', 6, 98),
 ('rohit', 5, 78),
 ('ratan', 7, 89),
 ('chintu', 8, 70),
 ('chunmun', 9, 90),
 ('ravi', 10, 67),
 ('ratul', 11, 87),
 ('ramesh', 12, 45),
 ('jack', 13, 40),
 ('jill', 14, 60),
 ('jishan', 15, 80)]

In [54]:
# no result as no marks is nill

result=cur.execute("select * from student where marks is null ")

for i in result:
    print(i)

In [55]:
# 

result=cur.execute("select * from student where marks is not null")

for i in result:
    print(i)

('Ajit', 1, 50)
('Amit', 2, 56)
('Aniket', 3, 67)
('barun', 4, 90)
('rajib', 6, 98)
('rohit', 5, 78)
('ratan', 7, 89)
('chintu', 8, 70)
('chunmun', 9, 90)
('ravi', 10, 67)
('ratul', 11, 87)
('ramesh', 12, 45)
('jack', 13, 40)
('jill', 14, 60)
('jishan', 15, 80)

# LIKE OPERATOR

In [57]:
results=cur.execute("select * from student where name like 'D%'")

for i in results:
    print(i)

In [58]:
result=cur.execute("select * from student where name like 'a%'")

In [59]:
for i in results:
    print(i)

('Ajit', 1, 50)
('Amit', 2, 56)
('Aniket', 3, 67)

In [60]:
result=cur.execute("select * from student where name like '%n'")

for i in results:
    print(i)

('barun', 4, 90)
('ratan', 7, 89)
('chunmun', 9, 90)
('jishan', 15, 80)

In [62]:
result=cur.execute("select * from student where name like '%nm%' ")

for i in results:
    print(i)

('chunmun', 9, 90)

In [64]:
result=cur.execute("select * from student where name like '%i%'")

for i in results:
    print(i, end=" ")

('Ajit', 1, 50) ('Amit', 2, 56) ('Aniket', 3, 67) ('rajib', 6, 98) ('rohit', 5, 78) ('chintu', 8, 70) ('ravi', 10, 67) ('jill', 14, 60) ('jishan', 15, 80)

In [65]:
result=cur.execute("select * from student where name like '_h%'")

for i in results:
    print(i)

('chintu', 8, 70)
('chunmun', 9, 90)

In [66]:
result=cur.execute("select * from student where marks is 70")

for i in result:
    print(i)

('chintu', 8, 70)

In [67]:
result=cur.execute("select * from student where marks is not 70")

for i in result:
    print(i,end=" ")

('Ajit', 1, 50) ('Amit', 2, 56) ('Aniket', 3, 67) ('barun', 4, 90) ('rajib', 6, 98) ('rohit', 5, 78) ('ratan', 7, 89) ('chunmun', 9, 90) ('ravi', 10, 67) ('ratul', 11, 87) ('ramesh', 12, 45) ('jack', 13, 40) ('jill', 14, 60) ('jishan', 15, 80)

In [74]:
results=cur.execute("select * from student where name is not 'Ajit'")

for i in results:
    print(i)

('Amit', 2, 56)
('Aniket', 3, 67)
('barun', 4, 90)
('rajib', 6, 98)
('rohit', 5, 78)
('ratan', 7, 89)
('chintu', 8, 70)
('chunmun', 9, 90)
('ravi', 10, 67)
('ratul', 11, 87)
('ramesh', 12, 45)
('jack', 13, 40)
('jill', 14, 60)
('jishan', 15, 100)

# Update record:

In [71]:
# update(table) set(column name)= (new value) where id=(value)

# example: update student set marks=81 where id=4

In [73]:
# update the record

sql="update student set marks=100 where id=15"
cur.execute(sql)
db1.commit()

In [75]:
sql="update student set marks=100 where name='jack'"
cur.execute(sql)
db1.commit()

In [76]:
results=cur.execute("select * from student")

for i in result:
    print(i)

('Ajit', 1, 50)
('Amit', 2, 56)
('Aniket', 3, 67)
('barun', 4, 90)
('rajib', 6, 98)
('rohit', 5, 78)
('ratan', 7, 89)
('chintu', 8, 70)
('chunmun', 9, 90)
('ravi', 10, 67)
('ratul', 11, 87)
('ramesh', 12, 45)
('jack', 13, 100)
('jill', 14, 60)
('jishan', 15, 100)

In [77]:
# multiple record update
sql="update student set marks=100 where id in(1,2)"
cur.execute(sql)
db1.commit()

In [1]:
results=cur.execute("select * from student")

for i in result:
    print(i,end=" ")

NameError: name 'cur' is not defined

In [1]:
import sqlite3

In [2]:
db1=sqlite3.connect("new_studentdatabase.db")

In [4]:
cur=db1.cursor()

In [5]:
result=cur.execute("select * from student")

for i in result:
    print(i,end=" ")

('Ajit', 1, 100) ('Amit', 2, 100) ('Aniket', 3, 67) ('barun', 4, 90) ('rajib', 6, 98) ('rohit', 5, 78) ('ratan', 7, 89) ('chintu', 8, 70) ('chunmun', 9, 90) ('ravi', 10, 67) ('ratul', 11, 87) ('ramesh', 12, 45) ('jack', 13, 100) ('jill', 14, 60) ('jishan', 15, 100)

In [8]:
sql="update student set marks=100 where id in(12)"
cur.execute(sql)
db1.commit()

In [10]:
result=cur.execute("select marks,name,id from student where id>=2 and marks>=80")

for i in result:
    print(i)

(90, 'barun', 4)
(98, 'rajib', 6)
(89, 'ratan', 7)
(90, 'chunmun', 9)
(87, 'ratul', 11)
(100, 'ramesh', 12)
(100, 'jack', 13)
(100, 'jishan', 15)

In [5]:
import sqlite3

In [7]:
db1=sqlite3.connect("new_studentdatabase.db")

In [8]:
cur=db1.cursor()

# delete any unwanted records:

FORMAT

#sql="delete from student where id=6"

#cur.execute(sql)

In [17]:
sql="delete from student where id=6"
cur.execute(sql)
db1.commit()

In [18]:
result=cur.execute("select * from student")
result.fetchall

In [19]:
for i in result:
    print(i)

('Ajit', 1, 100)
('Amit', 2, 20)
('Aniket', 3, 67)
('barun', 4, 90)
('rohit', 5, 78)
('ratan', 7, 89)
('chintu', 8, 70)
('chunmun', 9, 90)
('ravi', 10, 67)
('ratul', 11, 87)
('ramesh', 12, 100)
('jack', 13, 100)
('jill', 14, 60)
('jishan', 15, 100)

In [1]:
import sqlite3

In [2]:
db1=sqlite3.connect("new_studentdatabase.db")

In [3]:
cur=db1.cursor()

In [4]:
result=cur.execute("select * from student")

for i in result:
    print(i)

('Ajit', 1, 100)
('Amit', 2, 20)
('Aniket', 3, 67)
('barun', 4, 90)
('rohit', 5, 78)
('ratan', 7, 89)
('chintu', 8, 70)
('chunmun', 9, 90)
('ravi', 10, 67)
('ratul', 11, 87)
('ramesh', 12, 100)
('jack', 13, 100)
('jill', 14, 60)
('jishan', 15, 100)

In [6]:
sql="update student set marks=90 where id=12"

cur.execute(sql)
db1.commit()

In [8]:
result=cur.execute("select * from student")

result.fetchall()

[('Ajit', 1, 100),
 ('Amit', 2, 20),
 ('Aniket', 3, 67),
 ('barun', 4, 90),
 ('rohit', 5, 78),
 ('ratan', 7, 89),
 ('chintu', 8, 70),
 ('chunmun', 9, 90),
 ('ravi', 10, 67),
 ('ratul', 11, 87),
 ('ramesh', 12, 90),
 ('jack', 13, 100),
 ('jill', 14, 60),
 ('jishan', 15, 100)]

In [9]:
result=cur.execute("select * from student")

result.fetchall()

[('Ajit', 1, 100),
 ('Amit', 2, 20),
 ('Aniket', 3, 67),
 ('barun', 4, 90),
 ('rohit', 5, 78),
 ('ratan', 7, 89),
 ('chintu', 8, 70),
 ('chunmun', 9, 90),
 ('ravi', 10, 67),
 ('ratul', 11, 87),
 ('ramesh', 12, 90),
 ('jack', 13, 100),
 ('jill', 14, 60),
 ('jishan', 15, 100)]

In [11]:
sql="delete from student where id in(15,14)"

cur.execute(sql)
db1.commit()

In [12]:
r=cur.execute("Select * from student")

In [13]:
# after fectching 14,15 got deleted

r.fetchall()

[('Ajit', 1, 100),
 ('Amit', 2, 20),
 ('Aniket', 3, 67),
 ('barun', 4, 90),
 ('rohit', 5, 78),
 ('ratan', 7, 89),
 ('chintu', 8, 70),
 ('chunmun', 9, 90),
 ('ravi', 10, 67),
 ('ratul', 11, 87),
 ('ramesh', 12, 90),
 ('jack', 13, 100)]

# DROP TABLE student

In [14]:
# delete command is used to delete a row 

# drop command 

sql='drop table student'
results=cur.execute(sql)

In [15]:
results=cur.execute('select * from student')
results.fetchall()

OperationalError: no such table: student

In [17]:
# 
db1.close()

# LIFE CYCLE OF TABLE:

"""
CREATE DATABASE : import sqlite3
                  db1=sqlit3.connect("new_studentdatabase.db")
                  
CONNECT TO DATA BASE  : cur=db1.connect()

            CREATE TABLE and INSERTION ON TABLE : 

cur.execute("create table student(name text,id int primarykey, marks notnull)")
cur.execute("insert into student values('chintu',8,70),('chunmun',9,90),('ravi',10,67),('ratul',11,87),('ramesh',12,45)")
db1.commit()

QUARY ON TABLE  :   r=cur.execute("select name,id where marks= 90")

UPDATE OF TABLE : sql="update student set marks=100 where id in(12)"
                  cur.execute(sql)
                  db1.commit()

DELETE A ROW  : sql="delete from student where id=13"

DELETE A TABLE: sql="delete from student where id in(15,14)"
                cur.execute(sql)
                db1.commit()

DROP THE DATABASE= sql='drop table student'
                   results=cur.execute(sql)

CLOSE DATA BASE= DB1.CLOSE


"""

# Adding data in table with CSV (coma seperated values) file directly

In [18]:
# importing sql lite

import sqlite3

In [21]:
# creating data base
db=sqlite3.connect("D:\MySQLite3_database\scores_database.db")

# connecting to cursor
cur=db.cursor()

In [22]:
# creating table
cur.execute("CREATE TABLE score(gender TEXT, student_id INT PRIMARY KEY, marks int)")

In [24]:
# insert records into the table.(single record inserting)
cur.execute("INSERT INTO score(gender, student_id, marks) values('Male',100,55)")

In [25]:
# save the records permenently.(If you don't commit,next time you will not see the records in the table)
db.commit()

In [26]:
print(cur.rowcount, "Records inserted")

1 Records inserted

# inserting records from csv file

In [31]:
# open scores_file.csv file in read mode

with open('scores_file.csv','r')as file:
    total_records=0
    for row in file:
        cur.execute("insert into score values(?,?,?)",row.split(","))
        db.commit()
        total_records+=1
print(total_records,'Records inserted')

10 Records inserted

In [34]:
result=cur.execute("select * from score")
for row in result:
    print(row)

('Male', 100, 55)
('female', 101, 50)
('male', 102, 67)
('female', 103, 78)
('male', 104, 79)
('male', 105, 89)
('female', 106, 98)
('male', 107, 99)
('male', 108, 45)
('male', 109, 87)
('female', 110, 69)

In [37]:
sql="select * from score where student_id = 104"

In [38]:
result=cur.execute(sql)

for i in result:
    print(i)

('male', 104, 79)

How to change the order of records(Inscreasing or decreasing)

In [40]:
result=cur.execute("SELECT * FROM score ORDER BY marks desc ")
for i in result:
    print(i)

('male', 107, 99)
('female', 106, 98)
('male', 105, 89)
('male', 109, 87)
('male', 104, 79)
('female', 103, 78)
('female', 110, 69)
('male', 102, 67)
('Male', 100, 55)
('female', 101, 50)
('male', 108, 45)

In [43]:
# descending

result=cur.execute("SELECT * FROM score ORDER BY student_id desc")

for i in result:
    print(i)

('female', 110, 69)
('male', 109, 87)
('male', 108, 45)
('male', 107, 99)
('female', 106, 98)
('male', 105, 89)
('male', 104, 79)
('female', 103, 78)
('male', 102, 67)
('female', 101, 50)
('Male', 100, 55)

In [44]:
# single record update:

sql="UPDATE score SET MARKS = 90 WHERE student_id=100"

In [47]:
cur.execute(sql)

In [50]:
# accending

result=cur.execute("SELECT * FROM score ORDER BY marks asc")

for i in result:
    print(i)

('male', 108, 45)
('female', 101, 50)
('male', 102, 67)
('female', 110, 69)
('female', 103, 78)
('male', 104, 79)
('male', 109, 87)
('male', 105, 89)
('Male', 100, 90)
('female', 106, 98)
('male', 107, 99)

In [54]:
# minimum

result= cur.execute("SELECT MIN(marks) FROM score")
print('minimum marks',result.fetchone())

minimum marks (45,)

In [55]:
# maximum

result= cur.execute("SELECT MAX(marks) FROM score")
print('maximum marks =',result.fetchone())

maximum marks = (99,)

In [56]:
db.close()

balaji agro, dealshare

nungi

()